In [1]:
import pandas as pd

In [3]:
fpath = './data/babyNamesUS.csv'
raw = pd.read_csv(fpath)

In [4]:
raw.head()

  StateCode Sex  YearOfBirth      Name  Number
0        AK   F         1910      Mary      14
1        AK   F         1910     Annie      12
2        AK   F         1910      Anna      10
3        AK   F         1910  Margaret       8
4        AK   F         1910     Helen       7

In [6]:
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 5 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   StateCode    1048575 non-null  object
 1   Sex          1048575 non-null  object
 2   YearOfBirth  1048575 non-null  int64
 3   Name         1048575 non-null  object
 4   Number       1048575 non-null  int64
dtypes: int64(2), object(3)
memory usage: 40.0+ MB

In [8]:
#집계하기(pivot_table)
#df.pivot_table(index = '컬럼명',  columns = '컬럼명', values = '컬럼명', aggfunc = 'sum')
#aggfunc 옵션: sum, count, mean..
raw.pivot_table(index = 'Name', values = 'Number', aggfunc = 'sum')

        Number
Name
Aadan       18
Aaden      855
Aadhav      14
Aadhya     188
Aadi       116
...        ...
Zylah       36
Zyler       38
Zyon        97
Zyra        23
Zyrah        5

[20815 rows x 1 columns]

In [12]:
#컬럼별로 나눌 때
name_df = raw.pivot_table(index = 'Name', values = 'Number', aggfunc = 'sum', columns = 'Sex')
name_df

Sex         F      M
Name
Aadan     NaN   18.0
Aaden     NaN  855.0
Aadhav    NaN   14.0
Aadhya  188.0    NaN
Aadi      NaN  116.0
...       ...    ...
Zylah    36.0    NaN
Zyler     NaN   38.0
Zyon      6.0   91.0
Zyra     23.0    NaN
Zyrah     5.0    NaN

[20815 rows x 2 columns]

In [13]:
name_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20815 entries, Aadan to Zyrah
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   F       14140 non-null  float64
 1   M       8658 non-null   float64
dtypes: float64(2)
memory usage: 487.9+ KB

In [16]:
#비어있는 값 채워넣기(공통된 값, 임의의 수, 비어있는 데이터 분석에서 제외)
name_df = name_df.fillna(0)
name_df.head()

Sex         F      M
Name
Aadan     0.0   18.0
Aaden     0.0  855.0
Aadhav    0.0   14.0
Aadhya  188.0    0.0
Aadi      0.0  116.0

In [17]:
name_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20815 entries, Aadan to Zyrah
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   F       20815 non-null  float64
 1   M       20815 non-null  float64
dtypes: float64(2)
memory usage: 487.9+ KB

In [21]:
#남자이름, 여자이름 사용 순위
name_df.sort_values(by = 'M')

Sex             F         M
Name
Kasandra   2130.0       0.0
Lillyanna   442.0       0.0
Lillyanne    48.0       0.0
Lillybeth     5.0       0.0
Lilou         5.0       0.0
...           ...       ...
David      2003.0  615943.0
John       2398.0  670893.0
Robert     2469.0  674934.0
James      3050.0  693271.0
Michael    4133.0  725757.0

[20815 rows x 2 columns]

In [22]:
#ascending 활용
name_df.sort_values(by = 'M', ascending = False)

Sex           F         M
Name
Michael  4133.0  725757.0
James    3050.0  693271.0
Robert   2469.0  674934.0
John     2398.0  670893.0
David    2003.0  615943.0
...         ...       ...
Jemimah     5.0       0.0
Jemma     535.0       0.0
Jena     1819.0       0.0
Jenae     510.0       0.0
Zyrah       5.0       0.0

[20815 rows x 2 columns]

In [24]:
name_df.sort_values(by = 'M', ascending = False).head().index

Index(['Michael', 'James', 'Robert', 'John', 'David'], dtype='object', name='Name')

In [26]:
name_df.sort_values(by = 'F', ascending = False).head().index

Index(['Mary', 'Jennifer', 'Elizabeth', 'Patricia', 'Linda'], dtype='object', name='Name')

In [27]:
#컬럼별 데이터 종류 확인하기
raw.head()

  StateCode Sex  YearOfBirth      Name  Number
0        AK   F         1910      Mary      14
1        AK   F         1910     Annie      12
2        AK   F         1910      Anna      10
3        AK   F         1910  Margaret       8
4        AK   F         1910     Helen       7

In [28]:
#종류 확인
raw['StateCode'].unique()

array(['AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL'],
      dtype=object)

In [29]:
#종류별로 몇 개가 있는지
raw['StateCode'].value_counts()

CA    361128
AL    128556
AZ    108599
CO    101403
AR     97560
CT     78039
FL     61322
DC     53933
DE     30892
AK     27143
Name: StateCode, dtype: int64

In [31]:
raw['YearOfBirth'].value_counts()

2007    17166
2008    17109
2009    16914
2014    16820
2006    16810
        ...
1914     3997
1913     3417
1912     3148
1911     2392
1910     2358
Name: YearOfBirth, Length: 106, dtype: int64